Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/ImagingConf/SetImagingSettings/TC.IC.NVT.02_REQ_03.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>cam2</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <tt:Brightness>30</tt:Brightness>
        <tt:ColorSaturation>31</tt:ColorSaturation>
        <tt:Contrast>32</tt:Contrast>
        <tt:Sharpness>33</tt:Sharpness>
      </timg:ImagingSettings>
      <timg:ForcePersistence xmlns="">true</timg:ForcePersistence>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>