References/ASTT/TestSuits/Tests/ImagingConf/TC.IC.NVT.01/TC.IC.NVT.01_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <timg:GetImagingSettings>
      <timg:VideoSourceToken>cam2</timg:VideoSourceToken>
    </timg:GetImagingSettings>
  </soap:Body>
</soap:Envelope>