sample/imaging/GetOptions.req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <timg:GetOptions>
      <timg:VideoSourceToken>VideoSource_1</timg:VideoSourceToken>
    </timg:GetOptions>
  </soap:Body>
</soap:Envelope>
