sample/imaging/Move.req.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:Move>
      <timg:VideoSourceToken>VideoSource_1</timg:VideoSourceToken>
      <timg:Focus>
        <timg:Continuous>
         <tt:Speed>1</tt:Speed>
        </timg:Continuous>
      </timg:Focus>
    </timg:Move>
  </s:Body>
</s:Envelope>
