Version2/TestTool 2.01 experiment/TestTool.Setup/Requests/Imaging Configuration/SetImagingSettings/TC.IC.NVT.02_REQ_24.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>cam1</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <tt:Exposure>
          <tt:Mode>AUTO</tt:Mode>
          <tt:Priority>LowNoise</tt:Priority>
          <tt:Window bottom="1" top="1" right="1" left="1" />
          <tt:MinExposureTime>1</tt:MinExposureTime>
          <tt:MaxExposureTime>1</tt:MaxExposureTime>
          <tt:MinGain>1</tt:MinGain>
          <tt:MaxGain>1</tt:MaxGain>
          <tt:MinIris>1</tt:MinIris>
          <tt:MaxIris>1</tt:MaxIris>
          <tt:ExposureTime>1</tt:ExposureTime>
          <tt:Gain>1</tt:Gain>
          <tt:Iris>1</tt:Iris>
        </tt:Exposure>
      </timg:ImagingSettings>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>